package bot

const msgStudentsHelp = `Я - телеграм бот для проведения квизов 🤗.

Инструкции при работе со мной 👇:

1) Перейдите по ссылке от преподавателя
2) Отвечайте на вопросы
3) Получите от меня свой результат и топ-10 игроков.`

const msgStudentsData = `Скажите, пожалуйста, ваше ФИО и номер группы (пример: Иванов Иван Иванович 248).`

const msgStudentsDataMistake = `Некорректные данные.
Напишите ваше ФИО и номер группы, опираясь на пример.`

const msgStudentsRole = `Дождитесь от преподавателя ссылку на лобби, затем перейдите по ней и отвечайте на вопросы.`

const msgStudentsSuccessfullVerification = `Вы успешно зарегистрированы в роли студента 👍!` + "\n\n" + msgStudentsRole

const msgUnknownQuiz = `Квиз не найден 😔.`

const msgClosedLobby = `Лобби уже закрыто 🙁.`

const msgMaxParticipantNumber = `К сожалению, в лобби больше нет мест 🙁`

const msgQuizJoin = `Вы присоединены к квизу 👍!`

const msgAnswerAcceptance = `Ваш ответ принят 👌!`

const msgRepeatedAnswer = `Вы уже отвечали, засчитывается только первый ответ.`
